STMicroelectronics/STM32CubeH5/Projects/STM32H5F5J-DK/Applications/ROT/OEMiROT_Boot/Src/startup_stm32h5xx.c
  /* Wait for SRAM2 availability */
  while (READ_BIT(RAMCFG_SRAM2->ISR, (RAMCFG_FLAG_SRAMBUSY)) != 0U)
  {
    __NOP();
  }

  /* Reset the tamper event status */
#ifdef OEMIROT_DEV_MODE
  TamperEventCleared = 0;
#endif
  /* enable write access to backup domain */
  SET_BIT(PWR->DBPCR, PWR_DBPCR_DBP);
  (void)READ_REG(PWR->DBPCR); /* Dummy read to wait for write effectiveness */
  /* Enable clock for Tamper register access */
  SET_BIT(RCC->APB3ENR, RCC_APB3ENR_RTCAPBEN);
  (void)READ_REG(RCC->APB3ENR); /* Dummy read to wait for write effectiveness */

  /* Release reset of back-up domain in case it is set, to avoid
  blocking the device (system reset does not release it) */
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_VSWRST);
  (void)READ_REG(RCC->BDCR); /* Dummy read to wait for write effectiveness */

  /* Check if a tamper has occurred */
  if (TAMP->SR != TAMP_SR_NO_EVENT)
  {
    /* reset Tamper status */
    TAMP->SCR = 0xFFFFFFFFU;

    /* Clear the pending IRQ which has already been handled */
    NVIC_ClearPendingIRQ(TAMP_IRQn);
#ifdef OEMIROT_DEV_MODE
    /* Deactivation of tampers to reach a predictable log to help the developer */
    HAL_RTCEx_DeactivateTamper(&RTCHandle, RTC_TAMPER_ALL);

    /* memorize for log that event has been cleared */
    TamperEventCleared = 1U;
#else
    /* System Reset request */
    NVIC_SystemReset();
#endif /* OEMIROT_DEV_MODE */
  }
  else
  {
    /**  Enable TAMP IRQ , to catch tamper interrupt in TAMP_IRQHandler */
    /*  else a stack in SRAM2 is cleaned a HardFault can occur, at every pop of
    *  function */
#ifndef OEMIROT_DEV_MODE
    __enable_irq();
    NVIC_EnableIRQ(TAMP_IRQn);
#endif /* !OEMIROT_DEV_MODE */
  }

  /** After this point, the stack may be used */

  /* disable write access to backup domain */
  __DMB(); /* To wait for TAMP reg write complete before cutting access */
  CLEAR_BIT(PWR->DBPCR, PWR_DBPCR_DBP);

  __set_MSPLIM((uint32_t)(&__STACK_LIMIT));
  /* CMSIS System Initialization */
  SystemInit();
  uint32_t reg;
  /* Update current and alternate selectors on interruption of OBK swap sector request */
  reg = READ_BIT(FLASH->OPSR, FLASH_OPSR_CODE_OP);
  if ((reg == FLASH_OPERATION_TYPE_OBKSWAP) || (reg == FLASH_OPERATION_TYPE_OPTIONCHANGE))
  {
    (void) HAL_FLASH_Unlock();
    (void) HAL_FLASH_OB_Unlock();

    if (HAL_FLASH_OB_Launch() != HAL_OK)
    {
      Error_Handler();
    }

    (void) HAL_FLASH_OB_Lock();
    (void) HAL_FLASH_Lock();
  }

  __PROGRAM_START();                        /* Enter PreMain (C library entry point) */
}
